app/Controllers/CategoriasController.php

    public function index(){
        $model=new CategoriasModel();
        $data=$model->findAll();
---
SELECT *
FROM `categorias`

    public function show($id=null){
        $model= new CategoriasModel();
        $data=$model->getWhere(["id_categoria"=>$id])->getResult();
---
SELECT *
FROM `categorias`
WHERE `id_categoria` = '0'

    public function insertCategoria(){
        $data=[
            "nombre"=>$_POST["nombre"],
            "descripcion"=>$_POST["descripcion"]
        ];

        $model= new CategoriasModel();
        $model->insert($data);
---
INSERT INTO `categorias` (`nombre`, `descripcion`) VALUES ('Tennis', 'los mejores teniis\n')