app/Controllers/PersonasController.php

    public function index(){
        $model= new PersonasModel();
        $data= $model->findAll();
---
SELECT *
FROM `personas`

    public function indexXid($id=null){
        $model= new PersonasModel();
        $data = $model->getWhere(["id"=>$id])->getResult();
---
SELECT *
FROM `personas`
WHERE `id` = '1'

    public function insertarPersona(){
        $model = new PersonasModel();

        $data=[
            "nombre"=>$_POST["nombre"],
            "apellidos"=>$_POST["apellidos"],
            "fecha_nac"=>$_POST["fecha_nac"]
        ];

        $datos=$model->insert($data);
---
INSERT INTO `personas` (`nombre`, `apellidos`, `fecha_nac`) VALUES ('Tennis', 'Los mejores tennis', '22-09-2001')