app/Controllers/UsuariosController.php

    public function index(){
        $model=new UsuariosModel();
        $datos=$model->findAll();
---
SELECT *
FROM `usuarios`

    public function idUser($id=null){
        $model = new UsuariosModel();
        $datos=$model->getWhere(["id_usuario"=>$id])->getResult();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '1'

    public function insertUsuarios(){
        $datos=[
            "nombre"=>$_POST["nombre"],
            "contraseña"=>sha1($_POST["contraseña"])
        ];

        $model=new UsuariosModel();
        $model->insert($datos);
---
INSERT INTO `usuarios` (`nombre`, `contraseña`) VALUES ('Tennis', '123456|')